//! 专为力扣算法题设计的测试用例封装模块。您可以很轻松地引入此模块，然后调用各个子模块的 
//! `use_cases` 函数来获取针对该问题的测试用例。
//! 
//! 请注意，如果您将这个代码仓库作为独立 crate 引入，则某些用例可能无法使用。

////////////////////////////////////////////////////////////////////////////////

/// 为问题 #1 到 #99 设计的测试用例
pub mod c000_0xx {
    pub mod c000_005;
    pub mod c000_006;
    pub mod c000_007;
    pub mod c000_008;
    pub mod c000_009;
    pub mod c000_010;
    pub mod c000_011;
    pub mod c000_012;
    pub mod c000_013;
    pub mod c000_014;
    pub mod c000_015;
    pub mod c000_016;
}
