//! # 适用于国内版力扣的问题解法
//!
//! 请注意，虽然大部分题目与国际版相同，但少数题目的顺序、要求都有所差别。请您在测试使用时自行斟酌。
//!

////////////////////////////////////////////////////////////////////////////////

/// # 问题编号 #000 - #099
///
/// 当前模块中包含了题库问题 #000 到 #099 的解法
pub mod p000_0xx {
    /// 问题 #5《最长回文子串》
    pub mod p000_005;
    /// 问题 #6《Z 字形变换》
    pub mod p000_006;
    /// 问题 #7《整数反转》
    pub mod p000_007;
    /// 问题 #8《字符串转换整数 (atoi)》
    pub mod p000_008;
    /// 问题 #9《回文数》
    pub mod p000_009;
    /// 问题 #10《正则表达式匹配》
    pub mod p000_010;
    /// 问题 #11《盛最多水的容器》
    pub mod p000_011;
    /// 问题 #12《整数转罗马数字》
    pub mod p000_012;
    /// 问题 #13《罗马数字转整数》
    pub mod p000_013;
    /// 问题 #14《最长公共前缀》
    pub mod p000_014;
}
